Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/atdf/PIC32CX1025SG60100.atdf
        <register name="PRICTRL0" offset="0x14" rw="RW" size="4" initval="0x40404040" caption="Priority Control 0">
          <bitfield name="LVLPRI0" caption="Level 0 Channel Priority Number" mask="0x1F"/>
          <bitfield name="QOS0" caption="Level 0 Quality of Service" mask="0x60" values="DMAC_PRICTRL0__QOS0"/>
          <bitfield name="RRLVLEN0" caption="Level 0 Round-Robin Scheduling Enable" mask="0x80"/>
          <bitfield name="LVLPRI1" caption="Level 1 Channel Priority Number" mask="0x1F00"/>
          <bitfield name="QOS1" caption="Level 1 Quality of Service" mask="0x6000" values="DMAC_PRICTRL0__QOS1"/>
          <bitfield name="RRLVLEN1" caption="Level 1 Round-Robin Scheduling Enable" mask="0x8000"/>
          <bitfield name="LVLPRI2" caption="Level 2 Channel Priority Number" mask="0x1F0000"/>
          <bitfield name="QOS2" caption="Level 2 Quality of Service" mask="0x600000" values="DMAC_PRICTRL0__QOS2"/>
          <bitfield name="RRLVLEN2" caption="Level 2 Round-Robin Scheduling Enable" mask="0x800000"/>
          <bitfield name="LVLPRI3" caption="Level 3 Channel Priority Number" mask="0x1F000000"/>
          <bitfield name="QOS3" caption="Level 3 Quality of Service" mask="0x60000000" values="DMAC_PRICTRL0__QOS3"/>
          <bitfield name="RRLVLEN3" caption="Level 3 Round-Robin Scheduling Enable" mask="0x80000000"/>
        </register>
        <register name="INTPEND" offset="0x20" rw="RW" size="2" initval="0x0000" caption="Interrupt Pending">
          <bitfield name="ID" caption="Channel ID" mask="0x1F"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x100"/>
          <bitfield name="TCMPL" caption="Transfer Complete" mask="0x200"/>
          <bitfield name="SUSP" caption="Channel Suspend" mask="0x400"/>
          <bitfield name="CRCERR" caption="CRC Error" mask="0x1000"/>
          <bitfield name="FERR" caption="Fetch Error" mask="0x2000"/>
          <bitfield name="BUSY" caption="Busy" mask="0x4000"/>
          <bitfield name="PEND" caption="Pending" mask="0x8000"/>
        </register>
        <register name="INTSTATUS" offset="0x24" rw="R" size="4" initval="0x00000000" caption="Interrupt Status">
          <bitfield name="CHINT0" caption="Channel 0 Pending Interrupt" mask="0x1"/>
          <bitfield name="CHINT1" caption="Channel 1 Pending Interrupt" mask="0x2"/>
          <bitfield name="CHINT2" caption="Channel 2 Pending Interrupt" mask="0x4"/>
          <bitfield name="CHINT3" caption="Channel 3 Pending Interrupt" mask="0x8"/>
          <bitfield name="CHINT4" caption="Channel 4 Pending Interrupt" mask="0x10"/>
          <bitfield name="CHINT5" caption="Channel 5 Pending Interrupt" mask="0x20"/>
          <bitfield name="CHINT6" caption="Channel 6 Pending Interrupt" mask="0x40"/>
          <bitfield name="CHINT7" caption="Channel 7 Pending Interrupt" mask="0x80"/>
          <bitfield name="CHINT8" caption="Channel 8 Pending Interrupt" mask="0x100"/>
          <bitfield name="CHINT9" caption="Channel 9 Pending Interrupt" mask="0x200"/>
          <bitfield name="CHINT10" caption="Channel 10 Pending Interrupt" mask="0x400"/>
          <bitfield name="CHINT11" caption="Channel 11 Pending Interrupt" mask="0x800"/>
          <bitfield name="CHINT12" caption="Channel 12 Pending Interrupt" mask="0x1000"/>
          <bitfield name="CHINT13" caption="Channel 13 Pending Interrupt" mask="0x2000"/>
          <bitfield name="CHINT14" caption="Channel 14 Pending Interrupt" mask="0x4000"/>
          <bitfield name="CHINT15" caption="Channel 15 Pending Interrupt" mask="0x8000"/>
          <bitfield name="CHINT16" caption="Channel 16 Pending Interrupt" mask="0x10000"/>
          <bitfield name="CHINT17" caption="Channel 17 Pending Interrupt" mask="0x20000"/>
          <bitfield name="CHINT18" caption="Channel 18 Pending Interrupt" mask="0x40000"/>
          <bitfield name="CHINT19" caption="Channel 19 Pending Interrupt" mask="0x80000"/>
          <bitfield name="CHINT20" caption="Channel 20 Pending Interrupt" mask="0x100000"/>
          <bitfield name="CHINT21" caption="Channel 21 Pending Interrupt" mask="0x200000"/>
          <bitfield name="CHINT22" caption="Channel 22 Pending Interrupt" mask="0x400000"/>
          <bitfield name="CHINT23" caption="Channel 23 Pending Interrupt" mask="0x800000"/>
          <bitfield name="CHINT24" caption="Channel 24 Pending Interrupt" mask="0x1000000"/>
          <bitfield name="CHINT25" caption="Channel 25 Pending Interrupt" mask="0x2000000"/>
          <bitfield name="CHINT26" caption="Channel 26 Pending Interrupt" mask="0x4000000"/>
          <bitfield name="CHINT27" caption="Channel 27 Pending Interrupt" mask="0x8000000"/>
          <bitfield name="CHINT28" caption="Channel 28 Pending Interrupt" mask="0x10000000"/>
          <bitfield name="CHINT29" caption="Channel 29 Pending Interrupt" mask="0x20000000"/>
          <bitfield name="CHINT30" caption="Channel 30 Pending Interrupt" mask="0x40000000"/>
          <bitfield name="CHINT31" caption="Channel 31 Pending Interrupt" mask="0x80000000"/>
        </register>
        <register name="BUSYCH" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Busy Channels">
          <bitfield name="BUSYCH0" caption="Busy Channel 0" mask="0x1"/>
          <bitfield name="BUSYCH1" caption="Busy Channel 1" mask="0x2"/>
          <bitfield name="BUSYCH2" caption="Busy Channel 2" mask="0x4"/>
          <bitfield name="BUSYCH3" caption="Busy Channel 3" mask="0x8"/>
          <bitfield name="BUSYCH4" caption="Busy Channel 4" mask="0x10"/>
          <bitfield name="BUSYCH5" caption="Busy Channel 5" mask="0x20"/>
          <bitfield name="BUSYCH6" caption="Busy Channel 6" mask="0x40"/>
          <bitfield name="BUSYCH7" caption="Busy Channel 7" mask="0x80"/>
          <bitfield name="BUSYCH8" caption="Busy Channel 8" mask="0x100"/>
          <bitfield name="BUSYCH9" caption="Busy Channel 9" mask="0x200"/>
          <bitfield name="BUSYCH10" caption="Busy Channel 10" mask="0x400"/>
          <bitfield name="BUSYCH11" caption="Busy Channel 11" mask="0x800"/>
          <bitfield name="BUSYCH12" caption="Busy Channel 12" mask="0x1000"/>
          <bitfield name="BUSYCH13" caption="Busy Channel 13" mask="0x2000"/>
          <bitfield name="BUSYCH14" caption="Busy Channel 14" mask="0x4000"/>
          <bitfield name="BUSYCH15" caption="Busy Channel 15" mask="0x8000"/>
          <bitfield name="BUSYCH16" caption="Busy Channel 16" mask="0x10000"/>
          <bitfield name="BUSYCH17" caption="Busy Channel 17" mask="0x20000"/>
          <bitfield name="BUSYCH18" caption="Busy Channel 18" mask="0x40000"/>
          <bitfield name="BUSYCH19" caption="Busy Channel 19" mask="0x80000"/>
          <bitfield name="BUSYCH20" caption="Busy Channel 20" mask="0x100000"/>
          <bitfield name="BUSYCH21" caption="Busy Channel 21" mask="0x200000"/>
          <bitfield name="BUSYCH22" caption="Busy Channel 22" mask="0x400000"/>
          <bitfield name="BUSYCH23" caption="Busy Channel 23" mask="0x800000"/>
          <bitfield name="BUSYCH24" caption="Busy Channel 24" mask="0x1000000"/>
          <bitfield name="BUSYCH25" caption="Busy Channel 25" mask="0x2000000"/>
          <bitfield name="BUSYCH26" caption="Busy Channel 26" mask="0x4000000"/>
          <bitfield name="BUSYCH27" caption="Busy Channel 27" mask="0x8000000"/>
          <bitfield name="BUSYCH28" caption="Busy Channel 28" mask="0x10000000"/>
          <bitfield name="BUSYCH29" caption="Busy Channel 29" mask="0x20000000"/>
          <bitfield name="BUSYCH30" caption="Busy Channel 30" mask="0x40000000"/>
          <bitfield name="BUSYCH31" caption="Busy Channel 31" mask="0x80000000"/>
        </register>
        <register name="PENDCH" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="Pending Channels">
          <bitfield name="PENDCH0" caption="Pending Channel 0" mask="0x1"/>
          <bitfield name="PENDCH1" caption="Pending Channel 1" mask="0x2"/>
          <bitfield name="PENDCH2" caption="Pending Channel 2" mask="0x4"/>
          <bitfield name="PENDCH3" caption="Pending Channel 3" mask="0x8"/>
          <bitfield name="PENDCH4" caption="Pending Channel 4" mask="0x10"/>
          <bitfield name="PENDCH5" caption="Pending Channel 5" mask="0x20"/>
          <bitfield name="PENDCH6" caption="Pending Channel 6" mask="0x40"/>
          <bitfield name="PENDCH7" caption="Pending Channel 7" mask="0x80"/>
          <bitfield name="PENDCH8" caption="Pending Channel 8" mask="0x100"/>
          <bitfield name="PENDCH9" caption="Pending Channel 9" mask="0x200"/>
          <bitfield name="PENDCH10" caption="Pending Channel 10" mask="0x400"/>
          <bitfield name="PENDCH11" caption="Pending Channel 11" mask="0x800"/>
          <bitfield name="PENDCH12" caption="Pending Channel 12" mask="0x1000"/>
          <bitfield name="PENDCH13" caption="Pending Channel 13" mask="0x2000"/>
          <bitfield name="PENDCH14" caption="Pending Channel 14" mask="0x4000"/>
          <bitfield name="PENDCH15" caption="Pending Channel 15" mask="0x8000"/>
          <bitfield name="PENDCH16" caption="Pending Channel 16" mask="0x10000"/>
          <bitfield name="PENDCH17" caption="Pending Channel 17" mask="0x20000"/>
          <bitfield name="PENDCH18" caption="Pending Channel 18" mask="0x40000"/>
          <bitfield name="PENDCH19" caption="Pending Channel 19" mask="0x80000"/>
          <bitfield name="PENDCH20" caption="Pending Channel 20" mask="0x100000"/>
          <bitfield name="PENDCH21" caption="Pending Channel 21" mask="0x200000"/>
          <bitfield name="PENDCH22" caption="Pending Channel 22" mask="0x400000"/>
          <bitfield name="PENDCH23" caption="Pending Channel 23" mask="0x800000"/>
          <bitfield name="PENDCH24" caption="Pending Channel 24" mask="0x1000000"/>
          <bitfield name="PENDCH25" caption="Pending Channel 25" mask="0x2000000"/>
          <bitfield name="PENDCH26" caption="Pending Channel 26" mask="0x4000000"/>
          <bitfield name="PENDCH27" caption="Pending Channel 27" mask="0x8000000"/>
          <bitfield name="PENDCH28" caption="Pending Channel 28" mask="0x10000000"/>
          <bitfield name="PENDCH29" caption="Pending Channel 29" mask="0x20000000"/>
          <bitfield name="PENDCH30" caption="Pending Channel 30" mask="0x40000000"/>
          <bitfield name="PENDCH31" caption="Pending Channel 31" mask="0x80000000"/>
        </register>
        <register name="ACTIVE" offset="0x30" rw="R" size="4" initval="0x00000000" caption="Active Channel and Levels">
          <bitfield name="LVLEX0" caption="Level 0 Channel Trigger Request Executing" mask="0x1"/>
          <bitfield name="LVLEX1" caption="Level 1 Channel Trigger Request Executing" mask="0x2"/>
          <bitfield name="LVLEX2" caption="Level 2 Channel Trigger Request Executing" mask="0x4"/>
          <bitfield name="LVLEX3" caption="Level 3 Channel Trigger Request Executing" mask="0x8"/>
          <bitfield name="ID" caption="Active Channel ID" mask="0x1F00"/>
          <bitfield name="ABUSY" caption="Active Channel Busy" mask="0x8000"/>
          <bitfield name="BTCNT" caption="Active Channel Block Transfer Count" mask="0xFFFF0000"/>
        </register>
        <register name="BASEADDR" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Descriptor Memory Section Base Address">
          <bitfield name="BASEADDR" caption="Descriptor Memory Base Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="WRBADDR" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="Write-Back Memory Section Base Address">
          <bitfield name="WRBADDR" caption="Write-Back Memory Base Address" mask="0xFFFFFFFF"/>
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x40" size="0x10" count="32"/>
      </register-group>
