Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/atdf/PIC32CX1025SG60100.atdf
        <register name="INTENCLR" offset="0xC" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="Interrupt Enable Clear">
          <bitfield name="DONE" caption="Command Done Interrupt Clear" mask="0x1"/>
          <bitfield name="ADDRE" caption="Address Error" mask="0x2"/>
          <bitfield name="PROGE" caption="Programming Error Interrupt Clear" mask="0x4"/>
          <bitfield name="LOCKE" caption="Lock Error Interrupt Clear" mask="0x8"/>
          <bitfield name="ECCSE" caption="ECC Single Error Interrupt Clear" mask="0x10"/>
          <bitfield name="ECCDE" caption="ECC Dual Error Interrupt Clear" mask="0x20"/>
          <bitfield name="NVME" caption="NVM Error Interrupt Clear" mask="0x40"/>
          <bitfield name="SUSP" caption="Suspended Write Or Erase Interrupt Clear" mask="0x80"/>
          <bitfield name="SEESFULL" caption="Active SEES Full Interrupt Clear" mask="0x100"/>
          <bitfield name="SEESOVF" caption="Active SEES Overflow Interrupt Clear" mask="0x200"/>
          <bitfield name="SEEWRC" caption="SEE Write Completed Interrupt Clear" mask="0x400"/>
        </register>
        <register name="INTENSET" offset="0xE" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="Interrupt Enable Set">
          <bitfield name="DONE" caption="Command Done Interrupt Enable" mask="0x1"/>
          <bitfield name="ADDRE" caption="Address Error Interrupt Enable" mask="0x2"/>
          <bitfield name="PROGE" caption="Programming Error Interrupt Enable" mask="0x4"/>
          <bitfield name="LOCKE" caption="Lock Error Interrupt Enable" mask="0x8"/>
          <bitfield name="ECCSE" caption="ECC Single Error Interrupt Enable" mask="0x10"/>
          <bitfield name="ECCDE" caption="ECC Dual Error Interrupt Enable" mask="0x20"/>
          <bitfield name="NVME" caption="NVM Error Interrupt Enable" mask="0x40"/>
          <bitfield name="SUSP" caption="Suspended Write Or Erase  Interrupt Enable" mask="0x80"/>
          <bitfield name="SEESFULL" caption="Active SEES Full Interrupt Enable" mask="0x100"/>
          <bitfield name="SEESOVF" caption="Active SEES Overflow Interrupt Enable" mask="0x200"/>
          <bitfield name="SEEWRC" caption="SEE Write Completed Interrupt Enable" mask="0x400"/>
        </register>
        <register name="INTFLAG" offset="0x10" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="Interrupt Flag Status and Clear">
          <bitfield name="DONE" caption="Command Done" mask="0x1"/>
          <bitfield name="ADDRE" caption="Address Error" mask="0x2"/>
          <bitfield name="PROGE" caption="Programming Error" mask="0x4"/>
          <bitfield name="LOCKE" caption="Lock Error" mask="0x8"/>
          <bitfield name="ECCSE" caption="ECC Single Error" mask="0x10"/>
          <bitfield name="ECCDE" caption="ECC Dual Error" mask="0x20"/>
          <bitfield name="NVME" caption="NVM Error" mask="0x40"/>
          <bitfield name="SUSP" caption="Suspended Write Or Erase Operation" mask="0x80"/>
          <bitfield name="SEESFULL" caption="Active SEES Full" mask="0x100"/>
          <bitfield name="SEESOVF" caption="Active SEES Overflow" mask="0x200"/>
          <bitfield name="SEEWRC" caption="SEE Write Completed" mask="0x400"/>
        </register>
        <register name="STATUS" offset="0x12" rw="R" size="2" initval="0x0000" caption="Status">
          <bitfield name="READY" caption="Ready to accept a command" mask="0x1"/>
          <bitfield name="PRM" caption="Power Reduction Mode" mask="0x2"/>
          <bitfield name="LOAD" caption="NVM Page Buffer Active Loading" mask="0x4"/>
          <bitfield name="SUSP" caption="NVM Write Or Erase Operation Is Suspended" mask="0x8"/>
          <bitfield name="AFIRST" caption="BANKA First" mask="0x10"/>
          <bitfield name="BPDIS" caption="Boot Loader Protection Disable" mask="0x20"/>
          <bitfield name="BOOTPROT" caption="Boot Loader Protection Size" mask="0xF00" values="NVMCTRL_STATUS__BOOTPROT"/>
          <bitfield name="DBPE" caption="Dual Boot Protection Enable" mask="0x1000"/>
          <bitfield name="BPHL" caption="Boot Protect Hard Lock" mask="0x2000"/>
        </register>
        <register name="ADDR" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="ADDR" caption="NVM Address" mask="0xFFFFFF"/>
        </register>
        <register name="RUNLOCK" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Lock Section">
          <bitfield name="RUNLOCK" caption="Region Un-Lock Bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="PBLDATA" offset="0x1C" rw="R" size="4" count="2" initval="0xFFFFFFFF" caption="Page Buffer Load Data x">
          <bitfield name="DATA" caption="Page Buffer Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="ECCERR" offset="0x24" rw="R" size="4" initval="0x00000000" caption="ECC Error Status Register">
          <bitfield name="ADDR" caption="Error Address" mask="0xFFFFFF"/>
          <bitfield name="TYPEL" caption="Low Double-Word Error Type" mask="0x30000000" values="NVMCTRL_ECCERR__TYPEL"/>
          <bitfield name="TYPEH" caption="High Double-Word Error Type" mask="0xC0000000" values="NVMCTRL_ECCERR__TYPEH"/>
        </register>
        <register name="DBGCTRL" offset="0x28" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="ECCDIS" caption="Debugger ECC Read Disable" mask="0x1"/>
          <bitfield name="ECCELOG" caption="Debugger ECC Error Tracking Mode" mask="0x2"/>
        </register>
        <register name="BCTRL" offset="0x29" rw="RW" size="1" initval="0x00" caption="Boot Control">
          <bitfield name="BRPE" caption="Boot Read Protection Enable" mask="0x1"/>
        </register>
        <register name="SEECFG" offset="0x2A" rw="RW" size="1" initval="0x00" caption="SmartEEPROM Configuration Register">
          <bitfield name="WMODE" caption="Write Mode" mask="0x1" values="NVMCTRL_SEECFG__WMODE"/>
          <bitfield name="APRDIS" caption="Automatic Page Reallocation Disable" mask="0x2"/>
        </register>
        <register name="SEESTAT" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="SmartEEPROM Status Register">
          <bitfield name="ASEES" caption="Active SmartEEPROM Sector" mask="0x1"/>
          <bitfield name="BUSY" caption="Busy" mask="0x4"/>
          <bitfield name="LOCK" caption="SmartEEPROM Write Access Is Locked" mask="0x8"/>
          <bitfield name="RLOCK" caption="SmartEEPROM Write Access To Register Address Space Is Locked" mask="0x10"/>
          <bitfield name="SBLK" caption="Blocks Number In a Sector" mask="0xF00"/>
          <bitfield name="PSZ" caption="SmartEEPROM Page Size" mask="0x70000"/>
        </register>
      </register-group>
      <value-group name="NVMCTRL_CTRLA__PRM">
        <value name="SEMIAUTO" caption="NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access." value="0"/>
        <value name="FULLAUTO" caption="NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode when system is not in standby mode." value="1"/>
        <value name="MANUAL" caption="NVM block does not enter low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLA__WMODE">
        <value name="MAN" caption="Manual Write" value="0"/>
        <value name="ADW" caption="Automatic Double Word Write" value="1"/>
        <value name="AQW" caption="Automatic Quad Word" value="2"/>
        <value name="AP" caption="Automatic Page Write" value="3"/>
      </value-group>
