Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/atdf/PIC32CX1025SG60100.atdf
      <value-group name="NVMCTRL_CTRLB__CMD">
        <value name="EP" caption="Erase Page - Only supported in the USER and AUX pages." value="0x0"/>
        <value name="EB" caption="Erase Block - Erases the block addressed by the ADDR register, not supported in the user page" value="0x1"/>
        <value name="WP" caption="Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register, not supported in the user page" value="0x3"/>
        <value name="WQW" caption="Write Quad Word - Writes a 128-bit word at the location addressed by the ADDR register." value="0x4"/>
        <value name="SWRST" caption="Software Reset - Power-Cycle the NVM memory and replay the device automatic calibration procedure and resets the module configuration registers" value="0x10"/>
        <value name="LR" caption="Lock Region - Locks the region containing the address location in the ADDR register." value="0x11"/>
        <value name="UR" caption="Unlock Region - Unlocks the region containing the address location in the ADDR register." value="0x12"/>
        <value name="SPRM" caption="Sets the power reduction mode." value="0x13"/>
        <value name="CPRM" caption="Clears the power reduction mode." value="0x14"/>
        <value name="PBC" caption="Page Buffer Clear - Clears the page buffer." value="0x15"/>
        <value name="SSB" caption="Set Security Bit" value="0x16"/>
        <value name="BKSWRST" caption="Bank swap and system reset, if SMEE is used also reallocate SMEE data into the opposite BANK" value="0x17"/>
        <value name="CELCK" caption="Chip Erase Lock - DSU.CE command is not available" value="0x18"/>
        <value name="CEULCK" caption="Chip Erase Unlock - DSU.CE command is available" value="0x19"/>
        <value name="SBPDIS" caption="Sets STATUS.BPDIS, Boot loader protection is discarded until CBPDIS is issued or next start-up sequence" value="0x1A"/>
        <value name="CBPDIS" caption="Clears STATUS.BPDIS, Boot loader protection is not discarded" value="0x1B"/>
        <value name="SCEHL" caption="Set Chip Erase Hard Lock - DSU.CTRL.CE command is not available" value="0x1C"/>
        <value name="SBPHL" caption="Set Boot Protect Hard Lock" value="0x1D"/>
        <value name="ASEES0" caption="Activate SmartEEPROM Sector 0, deactivate Sector 1" value="0x30"/>
        <value name="ASEES1" caption="Activate SmartEEPROM Sector 1, deactivate Sector 0" value="0x31"/>
        <value name="SEERALOC" caption="Starts SmartEEPROM sector reallocation algorithm" value="0x32"/>
        <value name="LSEE" caption="Lock access to SmartEEPROM data from any mean" value="0x34"/>
        <value name="USEE" caption="Unlock access to SmartEEPROM data" value="0x35"/>
        <value name="LSEER" caption="Lock access to the SmartEEPROM Register Address Space (above 64KB)" value="0x36"/>
        <value name="USEER" caption="Unlock access to the SmartEEPROM Register Address Space (above 64KB)" value="0x37"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__CMDEX">
        <value name="KEY" caption="Execution Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__SEE">
        <value name="A" caption="163840 bytes" value="0xA"/>
        <value name="9" caption="147456 bytes" value="0x9"/>
        <value name="8" caption="131072 bytes" value="0x8"/>
        <value name="7" caption="114688 bytes" value="0x7"/>
        <value name="6" caption="98304 bytes" value="0x6"/>
        <value name="5" caption="81920 bytes" value="0x5"/>
        <value name="4" caption="65536 bytes" value="0x4"/>
        <value name="3" caption="49152 bytes" value="0x3"/>
        <value name="2" caption="32768 bytes" value="0x2"/>
        <value name="1" caption="16384 bytes" value="0x1"/>
        <value name="0" caption="0 bytes" value="0x0"/>
      </value-group>
      <value-group name="NVMCTRL_STATUS__BOOTPROT">
        <value name="0" caption="0 kbytes" value="0xF"/>
        <value name="8" caption="8 kbytes" value="0xE"/>
        <value name="16" caption="16 kbytes" value="0xD"/>
        <value name="24" caption="24 kbytes" value="0xC"/>
        <value name="32" caption="32 kbytes" value="0xB"/>
        <value name="40" caption="40 kbytes" value="0xA"/>
        <value name="48" caption="48 kbytes" value="0x9"/>
        <value name="56" caption="56 kbytes" value="0x8"/>
        <value name="64" caption="64 kbytes" value="0x7"/>
        <value name="72" caption="72 kbytes" value="0x6"/>
        <value name="80" caption="80 kbytes" value="0x5"/>
        <value name="88" caption="88 kbytes" value="0x4"/>
        <value name="96" caption="96 kbytes" value="0x3"/>
        <value name="104" caption="104 kbytes" value="0x2"/>
        <value name="112" caption="112 kbytes" value="0x1"/>
        <value name="120" caption="120 kbytes" value="0x0"/>
      </value-group>
      <value-group name="NVMCTRL_ECCERR__TYPEH">
        <value name="NONE" caption="No Error Detected Since Last Read" value="0"/>
        <value name="SINGLE" caption="At Least One Single Error Detected Since last Read" value="1"/>
        <value name="DUAL" caption="At Least One Dual Error Detected Since Last Read" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_ECCERR__TYPEL">
        <value name="NONE" caption="No Error Detected Since Last Read" value="0"/>
        <value name="SINGLE" caption="At Least One Single Error Detected Since last Read" value="1"/>
        <value name="DUAL" caption="At Least One Dual Error Detected Since Last Read" value="2"/>
      </value-group>
